rails/app/views/users/export_all.html.erb

        <% @books.each do |book| %>
            <% book.notes.each do |note| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."book_id" = ?  [["book_id", 1]]