rails/app/views/books/export_all_notes.erb

        <tbody>
          <% @book.notes.each do |note| %>
            <% note.update(contenthtml:markdown(note.content)) %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."book_id" = ?  [["book_id", 1]]
UPDATE "notes" SET "contenthtml" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["contenthtml", "<h1>prueba</h1>\n"], ["updated_at", "2021-01-24 21:55:44.747208"], ["id", 1]]