rails/app/controllers/books_controller.rb

  def create
    @book = @user.books.new(book_params)

    if @book.save
---
INSERT INTO "books" ("user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["name", "libro1"], ["created_at", "2021-01-24 21:25:25.662542"], ["updated_at", "2021-01-24 21:25:25.662542"]]

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "name" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["name", "libro24"], ["updated_at", "2021-01-11 15:43:06.124325"], ["id", 1]]

    def set_book
      @book = @user.books.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

    def set_book_export
      @book = @user.books.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]