rails/app/controllers/notes_controller.rb

INSERT INTO "notes" ("book_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @note = @book.notes.new(note_params)

    if @note.save

UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "nota 12"], ["updated_at", "2021-01-11 15:42:10.746161"], ["id", 1]]
---
  def update
    if @note.update(note_params)

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find(params[:book_id])

SELECT "notes".* FROM "notes" WHERE "notes"."book_id" = ? AND "notes"."id" = ? LIMIT ?  [["book_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_note
      @note = @book.notes.find(params[:id])

SELECT "notes".* FROM "notes" WHERE "notes"."book_id" = ? AND "notes"."id" = ? LIMIT ?  [["book_id", 1], ["id", 1], ["LIMIT", 1]]
---
    def set_note_export
      @note = @book.notes.find(params[:note_id])