rails/app/controllers/registrations_controller.rb

    def create
      super
      if current_user
        current_user.books.create(user_id: current_user.id,name:"cuaderno_global")
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
INSERT INTO "books" ("user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["name", "cuaderno_global"], ["created_at", "2021-01-23 03:03:31.867977"], ["updated_at", "2021-01-23 03:03:31.867977"]]