rails/app/controllers/users_controller.rb

    def set_user
      @users = User.all
---
SELECT "users".* FROM "users"